[
    {
        "chapter": "144",
        "house_vote": "127-3",
        "signed_no_signature": "0",
        "description": "Relating to legislative enactments; correcting miscellaneous oversights, inconsistencies, ambiguities, unintended results, and technical errors; amending Minnesota Statutes.",
        "presented": "5/22/13",
        "bill": "SF 1664",
        "signed": "5/24/13",
        "chamber": "senate",
        "senate_vote": "63-0",
        "vetoed": "0"
    },
    {
        "chapter": "143",
        "house_vote": "37-29",
        "signed_no_signature": "0",
        "description": "Relating to financing and operation of state and local government; making changes to individual income, corporate franchise, property, sales and use, estate, mineral, tobacco, alcohol, special, local, and other taxes and tax-related provisions modifying the property tax refund; changing property tax aids and credits; modifying the Sustainable Forest Incentive Act; modifying education aids and levies; providing additional pension funding; modifying definitions and distributions for property taxes; providing for property tax exemptions; modifying the payment in lieu of tax provisions; modifying education aids and levies; modifying tobacco tax provisions; making changes to additions and subtractions from federal taxable income; providing for federal conformity; changing income tax rates for individuals, estates, and trusts; providing income tax credits; modifying estate tax provisions; providing for a state gift tax; expanding the sales tax base; modifying the duty to collect and remit sales taxes for certain sellers; imposing the sales tax on digital products and selected services; modifying the definition of sale and purchase; modifying provisions for the rental motor vehicle tax rate; providing for multiple points of use certificates; modifying sales tax exemptions; authorizing local sales taxes; authorizing economic development powers; modifying tax increment financing rules; providing authority, organization, powers, duties, and requiring a prevailing wage for development of a Destination Medical Center; authorizing state infrastructure aid; modifying the distribution of taconite production taxes; authorizing taconite production tax bonds for grants to school districts; modifying and providing provisions for public finance; providing funding for legislative office facilities; modifying the definition of market value for tax, debt, and other purposes; making conforming, policy, and technical changes to tax provisions; requiring studies and reports; appropriating money; amending Minnesota Statutes.",
        "presented": "5/22/13",
        "bill": "HF 677",
        "signed": "5/23/13",
        "chamber": "house",
        "senate_vote": "37-29",
        "vetoed": "0"
    },
    {
        "chapter": "142",
        "house_vote": null,
        "signed_no_signature": "0",
        "description": "Relating to the operation of state government; providing funding for the legislature, constitutional officers and other agencies, boards, councils, commissions, and state entities; changing certain state government programs; changing powers and duties of certain state officers; repealing the Minnesota Sunset Act; requiring the chair of the Legislative Advisory Commission alternate between a member of the senate and a member of the house of representatives; requiring the chair of the Legislative Advisory Commission be a senate member in 2013; allowing the Legislative Advisory Commission to accept grants and gifts related to the commission's duties; requiring data security audits by the legislative auditor under certain circumstances; requiring notification of the legislative auditor when public resources have been used unlawfully or government data has been accessed unlawfully; allowing the secretary of state authority to accept funds from local government units for election systems enhancements and to receive certain funds for the address confidentiality program; allowing the state auditor to change a onetime user fee for a small city and town accounting system software; changing provisions for bid solicitations and proposals; changing certain provisions for service contracts and the solicitation process; requiring a determination of the information technology cost for agency technology cost for agency technology projects; expanding E-Government initiative and establishing the E-Government Advisory Council; allowing a convenience fee for users of NorthStar or online government information services; changing certain audit provisions relating to duties of the state auditor and the legislative auditor; allowing the state auditor to bill counties and political subdivisions periodically for services rendered; establishing a state auditor enterprise fund; modifying provisions for general noncommercial radio station and equipment grants; removing investigative powers of the Mississippi River Parkway Commission; changing a paid military leave provision; modifying provisions in the Veterans Service Office grant program; changing provisions in the Minnesota GI Bill program; establishing presumption of rehabilitation by an honorable discharge status from military service following a prior offense; providing for a bid preference for contracts for veteran-owned small businesses; allowing active duty service members to take a peace officer reciprocity exam; making Department of Revenue changes; establishing electronic filing requirements; establishing an automobile theft prevention surcharge; requesting the legislative auditor conduct a data security of the Department of Revenue's use of debit cards for tax refunds; adjusting certain salary groups; making compensation council changes; requiring a compensation study; adjusting constitutional officers salaries; requiring reports; appropriating money; amending Minnesota Statutes.",
        "presented": "5/22/13",
        "bill": "SF 1589A",
        "signed": "5/23/13",
        "chamber": "senate",
        "senate_vote": null,
        "vetoed": "0"
    },
    {
        "chapter": "141",
        "house_vote": "129-2",
        "signed_no_signature": "0",
        "description": "Relating to disaster assistance; appropriating money to match federal disaster aid for the April 2013 severe winter storm in southwest Minnesota.",
        "presented": "5/22/13",
        "bill": "SF 1656",
        "signed": "5/24/13",
        "chamber": "senate",
        "senate_vote": "65-0",
        "vetoed": "0"
    },
    {
        "chapter": "140",
        "house_vote": "132-2",
        "signed_no_signature": "0",
        "description": "Relating to transportation; motor vehicles; amending fees for certain motor vehicle titling transactions; appropriating money; amending statue.",
        "presented": "5/24/13",
        "bill": "HF 316",
        "signed": "5/22/13",
        "chamber": "house",
        "senate_vote": "64-0",
        "vetoed": "0"
    },
    {
        "chapter": "139",
        "house_vote": "121-12",
        "signed_no_signature": "0",
        "description": "Relating to public safety; creating increased penalties for wildfire arson that damages multiple buildings or dwellings, acreage, or crops, or causes demonstrable bodily harm; adding restitution provisions; amending Minnesota Statutes.",
        "presented": "5/22/13",
        "bill": "HF 228",
        "signed": "5/24/13",
        "chamber": "house",
        "senate_vote": "63-0",
        "vetoed": "0"
    },
    {
        "chapter": "138",
        "house_vote": "85-49",
        "signed_no_signature": "0",
        "description": "Relating to government operations; making various policy, technical, conforming, and other changes to campaign finance and public disclosure law; providing for additional disclosure; modifying certain regulations, reporting, spending and contribution limits, registration, definitions, and various procedures; modifying definition of public official; modifying penalties related to corporate political contributions; providing penalties; amending Minnesota Statutes.",
        "presented": "5/22/13",
        "bill": "SF 661",
        "signed": "5/24/13",
        "chamber": "senate",
        "senate_vote": "36-28",
        "vetoed": "0"
    },
    {
        "chapter": "137",
        "house_vote": null,
        "signed_no_signature": "0",
        "description": "Relating to state government; appropriating money from the outdoor heritage fund, clean water fund, parks and trails fund, and arts and cultural heritage fund; providing for watershed restoration and protection strategies; creating the Greater Minnesota Regional Parks and Trails Commission; extending previous appropriations; providing for the allocation of arts and cultural heritage fund to the Minnesota State Arts Board; modifying certain grant eligibility; providing for sale of wine and malt liquor at Capitol cafeteria; requiring Minnesota-made solar photovoltaic modules; requiring report and study;amending Minnesota Statutes 2012.\n\nThe Governor has signed Chapter 137, House File 1183, The Legacy Bill, with the exception of line item vetoes for Pages 13-14, lines 13.33-14.2 and Page 16, lines 16.3-9.  The Governor’s letter regarding the line item vetoes is attached.",
        "presented": "5/22/13",
        "bill": "HF 1183A",
        "signed": "5/23/13",
        "chamber": "house",
        "senate_vote": null,
        "vetoed": "1"
    },
    {
        "chapter": "136",
        "house_vote": "121-10",
        "signed_no_signature": "0",
        "description": "Relating to capital improvements; appropriating money to acquire and better public land and buildings and other improvements of a capital nature; authorizing the sale and issuance of state bonds; modifying and cancelling prior appropriations; amending Laws.",
        "presented": "5/22/13",
        "bill": "HF 1070",
        "signed": "5/24/13",
        "chamber": "house",
        "senate_vote": "58-6",
        "vetoed": "0"
    },
    {
        "chapter": "135",
        "house_vote": "115-18",
        "signed_no_signature": "0",
        "description": "Relating to commerce; making various technical and housekeeping changes related to staff adjusters, canceled licenses, and transfer fees; providing producer training requirements for flood insurance products; regulating the Commerce Fraud Bureau; requiring property and casualty actuarial opinions of reserves and supporting documentation; regulating the agricultural cooperative health plan for farmers; regulating real property appraisals; providing application, education, and training requirements; regulating certain Public Utilities Commission requests relating to service of notices, orders, and other documents; eliminating the membership camping license requirement; repealing an obsolete collection agency rule; correcting cross-references; making adjustments to various dollar amounts as required by state law; providing for a method to periodically update Minnesota Statutes to reflect the current dollar amounts as adjusted; amending Minnesota Statutes.",
        "presented": "5/22/13",
        "bill": "HF 1221",
        "signed": "5/24/13",
        "chamber": "house",
        "senate_vote": "62-0",
        "vetoed": "0"
    },
    {
        "chapter": "134",
        "house_vote": "77-56",
        "signed_no_signature": "0",
        "description": "Relating to state government; changing certain finance and budget provisions; adding the Office of MN.IT Services to certain provisions and changing certain MN.IT provisions; exempting the state information network from certain term limitations on contracts; amending Minnesota Statutes.",
        "presented": "5/22/13",
        "bill": "HF 1389",
        "signed": "5/24/13",
        "chamber": "house",
        "senate_vote": "44-12",
        "vetoed": "0"
    },
    {
        "chapter": "133",
        "house_vote": "130-4",
        "signed_no_signature": "0",
        "description": "Relating to crime; prescribing criminal penalties for assaulting a transit operator; amending Minnesota Statutes.",
        "presented": "5/22/13",
        "bill": "HF 590",
        "signed": "5/24/13",
        "chamber": "house",
        "senate_vote": "61-0",
        "vetoed": "0"
    },
    {
        "chapter": "132",
        "house_vote": "114-18",
        "signed_no_signature": "0",
        "description": "Relating to energy; modifying provisions related to distributed generation and renewable energy; regulating conservation improvement investments for low-income programs; modifying eminent domain and condemnation procedures; amending Minnesota Statutes.",
        "presented": "5/22/13",
        "bill": "HF 854",
        "signed": "5/24/13",
        "chamber": "house",
        "senate_vote": "51-11",
        "vetoed": "0"
    },
    {
        "chapter": "131",
        "house_vote": "99-32",
        "signed_no_signature": "0",
        "description": "Relating to elections; making policy, technical, and clarifying changes to various provisions related to election law, including provisions related to absentee voting, redistricting, ballots, registration, voting, caucuses, candidates, recounts, campaigns, voting rights, voting data, vacancies in nomination, and election administration; providing an electronic roster pilot project and task force; requiring reports; appropriating money; amending Minnesota Statutes.",
        "presented": "5/22/13",
        "bill": "HF 894",
        "signed": "5/23/13",
        "chamber": "house",
        "senate_vote": "65-0",
        "vetoed": "0"
    },
    {
        "chapter": "130",
        "house_vote": "107-26",
        "signed_no_signature": "0",
        "description": "Relating to insurance; regulating foreign language policies and advertising; authorizing electronic notices and documents; amending Minnesota Statutes.",
        "presented": "5/22/13",
        "bill": "HF 1587",
        "signed": "5/24/13",
        "chamber": "house",
        "senate_vote": "59-0",
        "vetoed": "0"
    },
    {
        "chapter": "129",
        "house_vote": "134-0",
        "signed_no_signature": "0",
        "description": "Relating to health; changing provisions for optometrists; amending Minnesota Statutes.",
        "presented": "5/22/13",
        "bill": "HF 607",
        "signed": "5/24/13",
        "chamber": "house",
        "senate_vote": "63-0",
        "vetoed": "0"
    },
    {
        "chapter": "128",
        "house_vote": "68-66",
        "signed_no_signature": "0",
        "description": "Relating to collective bargaining; authorizing collective bargaining for family child care providers; authorizing collective bargaining for home and community-based long-term care services; appropriating money ;proposing coding for new law in Minnesota Statutes.",
        "presented": "5/22/13",
        "bill": "SF 778",
        "signed": "5/24/13",
        "chamber": "senate",
        "senate_vote": "35-32",
        "vetoed": "0"
    },
    {
        "chapter": "127",
        "house_vote": "80-49",
        "signed_no_signature": "0",
        "description": "Relating to transportation; amending various provisions related to transportation and public safety policies, including highway signs, trunk highway routes, state-aid systems, motor vehicle registration and license plates, record retention, motor vehicle dealers, pupil transportation, bicycles, motor vehicle weight and equipment, disability parking, drivers' licenses and senior identification cards, federal law conformity, agency organization, commercial vehicle regulations, railroads, land conveyance, transit and transit planning, operations, and accessibility; amending Minnesota Statutes.",
        "presented": "5/22/13",
        "bill": "SF 1270",
        "signed": "5/24/13",
        "chamber": "senate",
        "senate_vote": "48-19",
        "vetoed": "0"
    },
    {
        "chapter": "126",
        "house_vote": "103-27",
        "signed_no_signature": "0",
        "description": "Relating to commerce; regulating motor vehicles; amending regulation of scrap metal processing; requiring proof of ownership or hold period for vehicles purchased for scrap; creating the automated property system; creating criminal penalties; amending Minnesota Statutes.",
        "presented": "5/22/13",
        "bill": "HF 1214",
        "signed": "5/24/13",
        "chamber": "house",
        "senate_vote": "42-15",
        "vetoed": "0"
    },
    {
        "chapter": "125",
        "house_vote": "123-0",
        "signed_no_signature": "0",
        "description": "Relating to legislative enactments; correcting erroneous, ambiguous, and omitted text and obsolete references; removing redundant, conflicting, and superseded provisions; making miscellaneous corrections to laws, statutes, and rules.",
        "presented": "5/22/13",
        "bill": "SF 827",
        "signed": "5/24/13",
        "chamber": "senate",
        "senate_vote": "62-0",
        "vetoed": "0"
    },
    {
        "chapter": "124",
        "house_vote": "69-62",
        "signed_no_signature": "1",
        "description": "Relating to state government; proposing an amendment to the Minnesota Constitution, article IV, section 9; authorizing a council to establish salaries for legislators; changing the composition of the Compensation Council.",
        "presented": "5/22/13",
        "bill": "HF 1823",
        "signed": "-",
        "chamber": "house",
        "senate_vote": "43-23",
        "vetoed": "0"
    },
    {
        "chapter": "123",
        "house_vote": "111-19",
        "signed_no_signature": "1",
        "description": "Relating to public safety; fire and police department aid; modifying threshold for financial reports and audits.",
        "presented": "5/22/13",
        "bill": "HF 853",
        "signed": "-",
        "chamber": "house",
        "senate_vote": "62-0",
        "vetoed": "0"
    },
    {
        "chapter": "122",
        "house_vote": "126-1",
        "signed_no_signature": "0",
        "description": "Relating to claims against the state; providing for settlement of certain claims; appropriating money.",
        "presented": "5/22/13",
        "bill": "HF 1792",
        "signed": "5/24/13",
        "chamber": "house",
        "senate_vote": "60-0",
        "vetoed": "0"
    },
    {
        "chapter": "121",
        "house_vote": "123-0",
        "signed_no_signature": "0",
        "description": "Relating to natural resources; modifying commissioner's authorities and duties; modifying definitions; modifying Minnesota Zoo provisions; modifying operating restrictions for all-terrain vehicles; modifying invasive species provisions; modifying watercraft provisions; providing for certain license seizures; modifying game and fish license provisions; modifying requirements for taking game and fish; providing for certain all-terrain vehicle registration and watercraft license exemptions; modifying nonresident all-terrain vehicle state trailpass requirements; requiring rulemaking.",
        "presented": "5/22/13",
        "bill": "SF 796",
        "signed": "5/24/13",
        "chamber": "senate",
        "senate_vote": "60-5",
        "vetoed": "0"
    },
    {
        "chapter": "120",
        "house_vote": "74-59",
        "signed_no_signature": "0",
        "description": "Relating to commerce; regulating bullion coin dealers; requiring registration; prohibiting certain conduct; providing enforcement authority and civil and criminal penalties.",
        "presented": "5/22/13",
        "bill": "HF 157",
        "signed": "5/24/13",
        "chamber": "house",
        "senate_vote": "63-0",
        "vetoed": "0"
    },
    {
        "chapter": "119",
        "house_vote": "119-11",
        "signed_no_signature": "0",
        "description": "Relating to bonds; modifying requirements for bond security.",
        "presented": "5/22/13",
        "bill": "HF 1118",
        "signed": "5/24/13",
        "chamber": "house",
        "senate_vote": "63-0",
        "vetoed": "0"
    },
    {
        "chapter": "118",
        "house_vote": "117-16",
        "signed_no_signature": "0",
        "description": "Relating to civil actions; prohibiting waivers of liability for negligent conduct.",
        "presented": "5/22/13",
        "bill": "HF 792",
        "signed": "5/24/13",
        "chamber": "house",
        "senate_vote": "61-0",
        "vetoed": "0"
    },
    {
        "chapter": "117",
        "house_vote": "43-24",
        "signed_no_signature": "0",
        "description": "Relating to government finance; appropriating money for transportation, Metropolitan Council, and public safety activities and programs; providing for fund transfers, tort claims, and contingent appropriations; modifying policy and tax provisions relating to transportation, transit, and public safety; making technical and clarifying changes.",
        "presented": "5/22/13",
        "bill": "HF 1444",
        "signed": "5/23/13",
        "chamber": "house",
        "senate_vote": "35-27",
        "vetoed": "0"
    },
    {
        "chapter": "116",
        "house_vote": "41-26",
        "signed_no_signature": "0",
        "description": "Relating to education; providing funding and policy for early childhood and family, prekindergarten through grade 12, and adult education, including general education, student accountability, education excellence, charter schools, special education, facilities, technology, nutrition, libraries, accounting, early childhood, self-sufficiency, lifelong learning, state agencies, and forecast adjustments; authorizing rulemaking; requiring reports; appropriating money.",
        "presented": "5/22/13",
        "bill": "HF 630",
        "signed": "5/24/13",
        "chamber": "house",
        "senate_vote": "35-28",
        "vetoed": "0"
    },
    {
        "chapter": "115",
        "house_vote": "123-0",
        "signed_no_signature": "0",
        "description": "Relating to real estate; requiring loss mitigation by mortgage lenders and servicers.",
        "presented": "5/22/13",
        "bill": "SF 1276",
        "signed": "5/24/13",
        "chamber": "senate",
        "senate_vote": "61-1",
        "vetoed": "0"
    },
    {
        "chapter": "114",
        "house_vote": "42-23",
        "signed_no_signature": "0",
        "description": "Relating to state government; appropriating money for environment, natural resources, and agriculture; modifying and providing for disposition of certain revenue; modifying pesticide control; providing certain fee exemptions; establishing agricultural water certification program; modifying Minnesota Noxious Weed Law; providing for biobased and biofuel products; modifying certain bond requirements; modifying animal waste technician provisions; making technical changes; modifying certain permit requirements; providing for federal law compliance; providing for certain easements; modifying all-terrain vehicle operating provisions; establishing pollinator habitat program; modifying snowmobile registration provisions; modifying state trails; modifying State Timber Act; modifying certain park boundaries and expenditures; modifying reporting requirements; modifying Petroleum Tank Release Cleanup Act; providing for silica sand mining model standards and technical assistance; providing for wastewater laboratory certification; providing for product stewardship program; providing for discontinuance of Hennepin County Soil and Water Conservation District; authorizing recreation of Hall's Island; providing for certain interim ordinance extension or renewal; repealing certain pollution control rules; modifying certain environmental review; modifying Water Law; modifying public utilities provisions; providing certain criteria for wastewater treatment systems; providing for sanitary districts; requiring studies and reports; requiring rulemaking.",
        "presented": "5/22/13",
        "bill": "HF 976",
        "signed": "5/23/13",
        "chamber": "house",
        "senate_vote": "38-27",
        "vetoed": "0"
    },
    {
        "chapter": "113",
        "house_vote": "128-0",
        "signed_no_signature": "0",
        "description": "relating to human services; modifying provisions related to chemical and mental health and human services licensing; establishing methadone treatment program standards; modifying drug treatment provisions; adding to the list of Schedule I controlled substances.",
        "presented": "5/22/13",
        "bill": "HF 1117",
        "signed": "5/24/13",
        "chamber": "house",
        "senate_vote": "56-0",
        "vetoed": "0"
    },
    {
        "chapter": "112",
        "house_vote": "124-8",
        "signed_no_signature": "0",
        "description": "Relating to public safety; providing immunity for underage possession or consumption of alcohol for a person contacting 911 to seek assistance for another.",
        "presented": "5/22/13",
        "bill": "HF 946",
        "signed": "5/24/13",
        "chamber": "house",
        "senate_vote": "51-10",
        "vetoed": "0"
    },
    {
        "chapter": "111",
        "house_vote": "78-53",
        "signed_no_signature": "0",
        "description": "Relating to retirement; modifying State Board of Investment provisions; MSRS administrative provisions; PERA administrative provisions; benefit accrual rate specification; revisions and repeals of former local police and paid firefighter relief association laws; volunteer firefighter retirement changes; one person and small group retirement changes; miscellaneous provisions; state patrol retirement plan financial solvency measures; PERA plans salary definitions; public employees police and fire retirement plan financial solvency measures; Teachers Retirement Association early retirement reduction factors; first class city teacher retirement increases and financial solvency measures; judges retirement plan financial solvency measures; requiring reports; appropriating money.",
        "presented": "5/22/13",
        "bill": "SF 489",
        "signed": "5/23/13",
        "chamber": "senate",
        "senate_vote": "38-27",
        "vetoed": "0"
    },
    {
        "chapter": "110",
        "house_vote": "134-0",
        "signed_no_signature": "0",
        "description": "Relating to business organizations; modifying certain duties and responsibilities of the secretary of state; providing a standard of conduct for directors of certain cooperatives.",
        "presented": "5/22/13",
        "bill": "HF 1112",
        "signed": "5/24/13",
        "chamber": "house",
        "senate_vote": "58-0",
        "vetoed": "0"
    },
    {
        "chapter": "109",
        "house_vote": "120-13",
        "signed_no_signature": "0",
        "description": "Relating to judiciary; modifying provisions governing records in juvenile court proceedings.",
        "presented": "5/22/13",
        "bill": "HF 392",
        "signed": "5/24/13",
        "chamber": "house",
        "senate_vote": "55-0",
        "vetoed": "0"
    },
    {
        "chapter": "108",
        "house_vote": "39-28",
        "signed_no_signature": "0",
        "description": "Relating to state government; establishing the health and human services budget; modifying provisions related to health care, continuing care, human services licensing, children and family services, program integrity, health-related licensing boards, chemical and mental health services, managed care organizations, waiver provider standards, home care, and the Department of Health; redesigning home and community-based services; establishing payment methodologies for home and community-based services; adjusting provider rates; setting and modifying fees; modifying autism coverage; modifying assistance programs; establishing Northstar care for children; making technical changes; requiring studies; requiring reports; appropriating money.",
        "presented": "5/22/13",
        "bill": "HF 1233",
        "signed": "5/23/13",
        "chamber": "house",
        "senate_vote": "36-28",
        "vetoed": "0"
    },
    {
        "chapter": "107",
        "house_vote": "101-28",
        "signed_no_signature": "0",
        "description": "Relating to human services; modifying provisions related to fair hearings and internal audits; creating the Cultural and Ethnic Leadership Communities Council; removing obsolete language; making technical changes.",
        "presented": "5/21/13",
        "bill": "HF 975",
        "signed": "5/24/13",
        "chamber": "house",
        "senate_vote": "37-26",
        "vetoed": "0"
    },
    {
        "chapter": "106",
        "house_vote": "81-44",
        "signed_no_signature": "0",
        "description": "relating to commerce; modifying securities registration and franchise registration provisions.",
        "presented": "5/21/13",
        "bill": "HF 1243",
        "signed": "5/24/13",
        "chamber": "house",
        "senate_vote": "50-0",
        "vetoed": "0"
    },
    {
        "chapter": "105",
        "house_vote": "126-0",
        "signed_no_signature": "0",
        "description": "Relating to the Public Facilities Authority; reorganizing certain grant programs; providing for small community wastewater treatment grants.",
        "presented": "5/21/13",
        "bill": "HF 819",
        "signed": "5/24/13",
        "chamber": "house",
        "senate_vote": "44-0",
        "vetoed": "0"
    },
    {
        "chapter": "104",
        "house_vote": "134-0",
        "signed_no_signature": "0",
        "description": "Relating to judgments; regulating assigned consumer debt default judgments; providing a limitation period to bring an action arising out of consumer debt; setting the bail amount for failure to comply with judgment debtor disclosure requirements in consumer debt cases.",
        "presented": "5/21/13",
        "bill": "HF 80",
        "signed": "5/24/13",
        "chamber": "house",
        "senate_vote": "49-0",
        "vetoed": "0"
    },
    {
        "chapter": "103",
        "house_vote": "133-0",
        "signed_no_signature": "0",
        "description": "Relating to commerce; regulating money transmitters; clarifying required fraud prevention measures.",
        "presented": "5/21/13",
        "bill": "HF 527",
        "signed": "5/24/13",
        "chamber": "house",
        "senate_vote": "63-0",
        "vetoed": "0"
    },
    {
        "chapter": "102",
        "house_vote": "132-0",
        "signed_no_signature": "0",
        "description": "Relating to transportation; amending regulations governing school bus use for special events.",
        "presented": "5/21/13",
        "bill": "HF 1304",
        "signed": "5/24/13",
        "chamber": "house",
        "senate_vote": "62-0",
        "vetoed": "0"
    },
    {
        "chapter": "101",
        "house_vote": "118-13",
        "signed_no_signature": "0",
        "description": "Relating to the Metropolitan Council; making miscellaneous technical corrections to statutes; removing and modifying obsolete language.",
        "presented": "5/21/13",
        "bill": "HF 738",
        "signed": "5/24/13",
        "chamber": "house",
        "senate_vote": "49-12",
        "vetoed": "0"
    },
    {
        "chapter": "100",
        "house_vote": "71-59",
        "signed_no_signature": "0",
        "description": "Relating to housing; landlord and tenant; imposing civil penalty for certain violations; amending certain provisions relating to tenants holding over; modifying certain time for appeal and notice of hearing; making technical, clarifying, and conforming changes.",
        "presented": "5/21/13",
        "bill": "HF 829",
        "signed": "5/24/13",
        "chamber": "house",
        "senate_vote": "58-0",
        "vetoed": "0"
    },
    {
        "chapter": "99",
        "house_vote": "76-56",
        "signed_no_signature": "0",
        "description": "Relating to education; postsecondary; establishing a budget for higher education; appropriating money to the Office of Higher Education, the Board of Trustees of the Minnesota State Colleges and Universities, the Board of Regents of the University of Minnesota, and the Mayo Clinic; appropriating money for tuition relief; providing for the treatment of undocumented immigrants with respect to financial aid and tuition; regulating bonus payments; establishing the Minnesota Discovery, Research, and Innovation Economy funding program; modifying provisions related to grants, awards, and aid, school registration, and licensure; requiring certain information to be provided in higher education budget proposals; making changes to the state grant program; establishing procedure for cancellation of required surety bond; repealing Higher Education Advisory Council; requiring a higher education mental health summit; creating a tribal college supplemental grant assistance program; recognizing veteran's experience and training for various higher education purposes; providing statewide electronic infrastructure; requiring reports.",
        "presented": "5/21/13",
        "bill": "SF 1236",
        "signed": "5/24/13",
        "chamber": "senate",
        "senate_vote": "46-18",
        "vetoed": "1"
    },
    {
        "chapter": "98",
        "house_vote": "129-0",
        "signed_no_signature": "0",
        "description": "Relating to health; permitting licensed health care professionals to order use of physical agent modalities, electrical stimulation, and ultrasound devices;\namending Minnesota Statutes.",
        "presented": "5/21/13",
        "bill": "HF 215",
        "signed": "5/24/13",
        "chamber": "house",
        "senate_vote": "56-0",
        "vetoed": "0"
    },
    {
        "chapter": "97",
        "house_vote": "133-1",
        "signed_no_signature": "0",
        "description": "Relating to Hennepin County; updating and making technical corrections to county contract provisions; amending Minnesota Statutes.",
        "presented": "5/21/13",
        "bill": "HF 1510",
        "signed": "5/24/13",
        "chamber": "house",
        "senate_vote": "56-0",
        "vetoed": "0"
    },
    {
        "chapter": "96",
        "house_vote": "131-0",
        "signed_no_signature": "0",
        "description": "Relating to public safety; clarifying when conditional release terms of certain offenders begin; amending Minnesota Statutes.",
        "presented": "5/21/13",
        "bill": "HF 790",
        "signed": "5/24/13",
        "chamber": "house",
        "senate_vote": "52-0",
        "vetoed": "0"
    },
    {
        "chapter": "95",
        "house_vote": "70-56",
        "signed_no_signature": "0",
        "description": "Relating to state government; updating provisions in the Geospatial Information Office; amending Minnesota Statutes.",
        "presented": "5/21/13",
        "bill": "HF 1390",
        "signed": "5/24/13",
        "chamber": "house",
        "senate_vote": "36-27",
        "vetoed": "0"
    },
    {
        "chapter": "94",
        "house_vote": "128-0",
        "signed_no_signature": "0",
        "description": "Relating to probate; authorizing inventory and emergency order protecting specified personal property of homicide victim to preserve rights of decedent's heirs and beneficiaries; adding notice of rights and procedures to crime victims' chapter; amending Minnesota Statutes.",
        "presented": "5/21/13",
        "bill": "HF 161",
        "signed": "5/24/13",
        "chamber": "house",
        "senate_vote": "48-0",
        "vetoed": "0"
    },
    {
        "chapter": "93",
        "house_vote": "129-0",
        "signed_no_signature": "0",
        "description": "Relating to transportation; bridges; providing for disposition of remnant steel of I-35W bridge; proposing coding for new law in Minnesota Statutes.",
        "presented": "5/21/13",
        "bill": "HF 1451",
        "signed": "5/24/13",
        "chamber": "house",
        "senate_vote": "49-0",
        "vetoed": "0"
    },
    {
        "chapter": "92",
        "house_vote": "125-1",
        "signed_no_signature": "0",
        "description": "Relating to environment; requiring report of hazardous substance release to local 911 emergency dispatch center; amending Minnesota Statutes.",
        "presented": "5/21/13",
        "bill": "HF 814",
        "signed": "5/24/13",
        "chamber": "house",
        "senate_vote": "51-1",
        "vetoed": "0"
    },
    {
        "chapter": "91",
        "house_vote": "128-0",
        "signed_no_signature": "0",
        "description": "Relating to debt management and debt settlement; clarifying exemption for attorneys at law; modifying regulation of debt settlement services; amending Minnesota Statutes.",
        "presented": "5/21/13",
        "bill": "HF 694",
        "signed": "5/24/13",
        "chamber": "house",
        "senate_vote": "52-0",
        "vetoed": "0"
    },
    {
        "chapter": "90",
        "house_vote": "128-0",
        "signed_no_signature": "0",
        "description": "Relating to courts; prohibiting exclusion from jury service on the basis of marital status or sexual orientation; amending Minnesota Statutes.",
        "presented": "5/21/13",
        "bill": "HF 335",
        "signed": "5/24/13",
        "chamber": "house",
        "senate_vote": "39-13",
        "vetoed": "0"
    },
    {
        "chapter": "89",
        "house_vote": "57-0",
        "signed_no_signature": "0",
        "description": "Relating to civil actions; changing the limitation period for civil actions involving sexual abuse; amending Minnesota Statutes.",
        "presented": "5/21/13",
        "bill": "HF 681",
        "signed": "5/24/13",
        "chamber": "house",
        "senate_vote": "66-0",
        "vetoed": "0"
    },
    {
        "chapter": "88",
        "house_vote": "128-0",
        "signed_no_signature": "0",
        "description": "Relating to commerce; regulating building and construction contracts; prohibiting certain agreements to insure; amending Minnesota Statutes.",
        "presented": "5/21/13",
        "bill": "SF 561",
        "signed": "5/24/13",
        "chamber": "senate",
        "senate_vote": "66-0",
        "vetoed": "0"
    },
    {
        "chapter": "87",
        "house_vote": "99-35",
        "signed_no_signature": "0",
        "description": "Relating to employment; modifying use of personal sick leave benefits; requiring a report; amending Minnesota Statutes.",
        "presented": "5/21/13",
        "bill": "SF 840",
        "signed": "5/24/13",
        "chamber": "senate",
        "senate_vote": "62-0",
        "vetoed": "0"
    },
    {
        "chapter": "86",
        "house_vote": "121-12",
        "signed_no_signature": "0",
        "description": "Relating to criminal justice; modifying certain provisions relating to public safety, courts, guardians and conservators, corrections, offenders, and data integration; requiring reports; providing for penalties; appropriating money for courts, Guardian Ad Litem Board, Uniform Laws Commission, Board on Judicial Standards, Board of Public Defense, sentencing guidelines, public safety, Peace Officer Standards and Training (POST) Board, Private Detective Board, human rights, and corrections; amending Minnesota Statutes.",
        "presented": "5/21/13",
        "bill": "SF 671",
        "signed": "5/23/13",
        "chamber": "senate",
        "senate_vote": "47-18",
        "vetoed": "0"
    },
    {
        "chapter": "85",
        "house_vote": "40-27",
        "signed_no_signature": "0",
        "description": "Relating to state government; appropriating money for jobs and economic development; modifying labor and industry; employment, economic development, and workforce development; unemployment insurance;miscellaneous provisions; commerce and consumer protection; utility regulation; energy and solar energy regulations; creating various renewable energy incentives; imposing penalties; increasing fees; requiring reports; authorizing rulemaking; appropriating money to various state boards, agencies, and departments; amending Minnesota Statutes.",
        "presented": "5/21/13",
        "bill": "HF 729",
        "signed": "5/23/13",
        "chamber": "house",
        "senate_vote": "42-19",
        "vetoed": "0"
    },
    {
        "chapter": "84",
        "house_vote": "73-59",
        "signed_no_signature": "0",
        "description": "Relating to health plan regulation; regulating policy and contract coverages; conforming state law to federal requirements; establishing health plan market rules; modifying the designation of essential community providers; amending Minnesota Statutes.",
        "presented": "5/21/13",
        "bill": "HF 779",
        "signed": "5/24/13",
        "chamber": "house",
        "senate_vote": "40-23",
        "vetoed": "0"
    },
    {
        "chapter": "83",
        "house_vote": "76-56",
        "signed_no_signature": "0",
        "description": "Relating to state government; providing additional whistleblower protection to state employees; amending Minnesota Statutes.",
        "presented": "5/21/13",
        "bill": "HF 542",
        "signed": "5/24/13",
        "chamber": "house",
        "senate_vote": "61-0",
        "vetoed": "0"
    },
    {
        "chapter": "82",
        "house_vote": "133-0",
        "signed_no_signature": "0",
        "description": "Relating to state government; classifying or modifying certain provisions concerning data practices; requiring informed consent; amending definitions; allowing disclosure of certain data; allowing access to certain records; making technical changes; modifying certain provisions regarding transportation and health data; modifying certain provisions regarding criminal history records, criminal background checks, and other criminal justice data provisions; clarifying provisions regarding data on homestead and other tax applications; extending for six years the sunset provision for the newborn screening advisory committee; requiring a newborn screening program study; providing for destruction of data from mileage-based user fee pilot project; repealing the McGruff safe house program.",
        "presented": "5/21/13",
        "bill": "SF 745",
        "signed": "5/23/13",
        "chamber": "senate",
        "senate_vote": "41-24",
        "vetoed": "0"
    },
    {
        "chapter": "81",
        "house_vote": "130-2",
        "signed_no_signature": "0",
        "description": "Relating to human services; modifying provisions related to health care and medical assistance.",
        "presented": "5/16/13",
        "bill": "SF 654",
        "signed": "5/20/13",
        "chamber": "senate",
        "senate_vote": "58-0",
        "vetoed": "0"
    },
    {
        "chapter": "80",
        "house_vote": "132-0",
        "signed_no_signature": "0",
        "description": "Relating to crime; providing for forfeiture of money used or intended for use to facilitate a prostitution or sex trafficking offense; appropriating money.",
        "presented": "5/16/13",
        "bill": "SF 346",
        "signed": "5/20/13",
        "chamber": "senate",
        "senate_vote": "56-0",
        "vetoed": "0"
    },
    {
        "chapter": "79",
        "house_vote": "120-4",
        "signed_no_signature": "0",
        "description": "Senate File 1006: Relating to lawful gambling; modifying account, record keeping, and other regulatory provisions.",
        "presented": "5/16/13",
        "bill": "SF 1006",
        "signed": "5/20/13",
        "chamber": "senate",
        "senate_vote": "60-0",
        "vetoed": "0"
    },
    {
        "chapter": "78",
        "house_vote": "130-0",
        "signed_no_signature": "0",
        "description": "Relating to the military; updating the Minnesota Code of Military Justice; providing clarifying language.",
        "presented": "5/16/13",
        "bill": "HF 1138",
        "signed": "5/20/13",
        "chamber": "house",
        "senate_vote": "66-0",
        "vetoed": "0"
    },
    {
        "chapter": "77",
        "house_vote": "77-52",
        "signed_no_signature": "0",
        "description": "Relating to state government; ratifying labor agreements and compensation plans.",
        "presented": "5/16/13",
        "bill": "HF 1069",
        "signed": "5/20/13",
        "chamber": "house",
        "senate_vote": "47-14",
        "vetoed": "0"
    },
    {
        "chapter": "76",
        "house_vote": "128-0",
        "signed_no_signature": "0",
        "description": "Relating to state government; regulating data protection for victims of violence.",
        "presented": "5/16/13",
        "bill": "HF 580",
        "signed": "5/20/13",
        "chamber": "house",
        "senate_vote": "60-0",
        "vetoed": "0"
    },
    {
        "chapter": "75",
        "house_vote": "108-20",
        "signed_no_signature": "0",
        "description": "Relating to natural resources; requiring general permit for mechanical control of certain cattails.",
        "presented": "5/16/13",
        "bill": "HF 461",
        "signed": "5/20/13",
        "chamber": "house",
        "senate_vote": "61-0",
        "vetoed": "0"
    },
    {
        "chapter": "74",
        "house_vote": "75-59",
        "signed_no_signature": "0",
        "description": "Relating to marriage; providing for civil marriage between two persons; providing for exemptions and protections based on religious association.",
        "presented": "5/13/13",
        "bill": "HF 1054",
        "signed": "5/14/13",
        "chamber": "house",
        "senate_vote": "37-30",
        "vetoed": "0"
    },
    {
        "chapter": "73",
        "house_vote": "126-3",
        "signed_no_signature": "0",
        "description": "Relating to state lands; modifying landowners' bill of rights; modifying land acquisition account; providing for school forests; adding to and deleting from state parks and forests; authorizing certain exchanges and sales of state lands; conveyance of certain tax-forfeited lands.",
        "presented": "5/16/13",
        "bill": "HF 740",
        "signed": "5/20/13",
        "chamber": "house",
        "senate_vote": "61-0",
        "vetoed": "0"
    },
    {
        "chapter": "72",
        "house_vote": "128-0",
        "signed_no_signature": "0",
        "description": "Relating to human rights; changing provisions for certain certificates of compliance.",
        "presented": "5/16/13",
        "bill": "SF 1307",
        "signed": "5/20/13",
        "chamber": "senate",
        "senate_vote": "57-3",
        "vetoed": "0"
    },
    {
        "chapter": "68",
        "house_vote": "118-10",
        "signed_no_signature": "0",
        "description": "Relating to commerce; weights and measures; adding a requirement for identical product pricing; making technical updates to bring state into compliance with most recent federal fuel standards; establishing a minimum octane rating; modifying disclosure requirements for biodiesel and biofuel blends; modifying E85 requirements.",
        "presented": "5/13/13",
        "bill": "HF 634",
        "signed": "5/16/13",
        "chamber": "house",
        "senate_vote": "63-0",
        "vetoed": "0"
    },
    {
        "chapter": "67",
        "house_vote": "109-13",
        "signed_no_signature": "0",
        "description": "Relating to commerce; prohibiting restriction on sale of motor fuel.",
        "presented": "5/13/13",
        "bill": "HF 1284",
        "signed": "5/16/13",
        "chamber": "house",
        "senate_vote": "56-3",
        "vetoed": "0"
    },
    {
        "chapter": "66",
        "house_vote": "70-57",
        "signed_no_signature": "0",
        "description": "Relating to metropolitan government; providing for redistricting of the Metropolitan Council districts.",
        "presented": "5/13/13",
        "bill": "SF 1564",
        "signed": "5/16/13",
        "chamber": "senate",
        "senate_vote": "36-27",
        "vetoed": "0"
    },
    {
        "chapter": "65",
        "house_vote": "123-5",
        "signed_no_signature": "0",
        "description": "Relating to family law; adoption; modifying certain child placement proceedings.",
        "presented": "5/13/13",
        "bill": "SF 250",
        "signed": "5/16/13",
        "chamber": "senate",
        "senate_vote": "50-5",
        "vetoed": "0"
    },
    {
        "chapter": "64",
        "house_vote": null,
        "signed_no_signature": "0",
        "description": "Relating to economic development; modifying loans to development authorities.",
        "presented": "5/13/13",
        "bill": "HF 340",
        "signed": "5/16/13",
        "chamber": "house",
        "senate_vote": null,
        "vetoed": "0"
    },
    {
        "chapter": "63",
        "house_vote": "125-3",
        "signed_no_signature": "0",
        "description": "Relating to human services; making changes to continuing care provisions; modifying provisions related to advisory task forces, nursing homes, resident relocation, medical assistance, long-term care consultation services, assessments, and reporting of maltreatment; requiring a report.",
        "presented": "5/13/13",
        "bill": "HF 767",
        "signed": "5/16/13",
        "chamber": "house",
        "senate_vote": "66-0",
        "vetoed": "0"
    },
    {
        "chapter": "62",
        "house_vote": "128-0",
        "signed_no_signature": "0",
        "description": "Relating to human services; updating outdated terminology.",
        "presented": "5/13/13",
        "bill": "HF 760",
        "signed": "5/16/13",
        "chamber": "house",
        "senate_vote": "63-0",
        "vetoed": "0"
    },
    {
        "chapter": "52",
        "house_vote": "113-14",
        "signed_no_signature": "0",
        "description": "Relating to natural resources; appropriating money from environment and natural resources trust fund; modifying provisions for Legislative-Citizen Commission on Minnesota Resources; modifying requirements for land acquisition with trust fund money.",
        "presented": "5/8/13",
        "bill": "HF 1113",
        "signed": "5/9/13",
        "chamber": "house",
        "senate_vote": "55-6",
        "vetoed": "0"
    },
    {
        "chapter": "51",
        "house_vote": "76-56",
        "signed_no_signature": "0",
        "description": "Relating to health; requiring a hospital staffing report; requiring a study on nurse staffing levels and patient outcomes; appropriating money.",
        "presented": "5/8/13",
        "bill": "HF 588",
        "signed": "5/9/13",
        "chamber": "house",
        "senate_vote": "36-25",
        "vetoed": "0"
    },
    {
        "chapter": "50",
        "house_vote": "124-7",
        "signed_no_signature": "0",
        "description": "Relating to commerce; preventing fraud; regulating money transmissions; establishing a no transmit list; requiring certain notifications and verifications.",
        "presented": "5/8/13",
        "bill": "HF 194",
        "signed": "5/9/13",
        "chamber": "house",
        "senate_vote": "54-0",
        "vetoed": "0"
    },
    {
        "chapter": "49",
        "house_vote": "76-50",
        "signed_no_signature": "0",
        "description": "Relating to human services; distinguishing and clarifying law regarding civil commitment of sexually dangerous persons and persons with sexual psychopathic personalities from other civil commitments.",
        "presented": "5/8/13",
        "bill": "HF 947",
        "signed": "5/9/13",
        "chamber": "house",
        "senate_vote": "59-0",
        "vetoed": "0"
    },
    {
        "chapter": "48",
        "house_vote": "125-3",
        "signed_no_signature": "0",
        "description": "Relating to workforce development; adding a representative from adult basic education programs to the Workforce Development Council.",
        "presented": "5/6/13",
        "bill": "SF 380",
        "signed": "5/8/13",
        "chamber": "senate",
        "senate_vote": "65-0",
        "vetoed": "0"
    },
    {
        "chapter": "47",
        "house_vote": "128-0",
        "signed_no_signature": "0",
        "description": "Relating to public safety; modifying certain provisions regarding domestic abuse.",
        "presented": "5/6/13",
        "bill": "HF 1400",
        "signed": "5/8/13",
        "chamber": "house",
        "senate_vote": "61-0",
        "vetoed": "0"
    },
    {
        "chapter": "46",
        "house_vote": "100-22",
        "signed_no_signature": "0",
        "description": "Relating to local government; authorizing publication of advertisements for competitive bids in a recognized industry trade journal; requiring a report.",
        "presented": "5/6/13",
        "bill": "SF 843",
        "signed": "5/8/13",
        "chamber": "senate",
        "senate_vote": "63-0",
        "vetoed": "0"
    },
    {
        "chapter": "45",
        "house_vote": "104-18",
        "signed_no_signature": "0",
        "description": "Relating to solid waste; amending process for cities to implement organized collection of solid waste.",
        "presented": "5/3/13",
        "bill": "SF 510",
        "signed": "5/7/13",
        "chamber": "senate",
        "senate_vote": "66-0",
        "vetoed": "0"
    },
    {
        "chapter": "44",
        "house_vote": "125-0",
        "signed_no_signature": "0",
        "description": "Relating to health; making changes to the Medical Practice Act.",
        "presented": "5/3/13",
        "bill": "SF 825",
        "signed": "5/7/13",
        "chamber": "senate",
        "senate_vote": "58-6",
        "vetoed": "0"
    },
    {
        "chapter": "43",
        "house_vote": "79-47",
        "signed_no_signature": "0",
        "description": "Relating to health; classifying criminal history record data on Minnesota Responds Medical Reserve Corps volunteers; requiring certain interviews for investigation of vulnerable adult complaints against HMO; enacting the Minnesota Radon Awareness Act; requiring radon education disclosure for residential real property; changing provisions for tuberculosis standards; changing adverse health events reporting requirements; modifying a poison control provision; providing liability coverage for certain volunteer medical personnel and permitting agreements to conduct criminal background studies; changing provisions for body art establishments and body art technicians; defining occupational therapy practitioners; changing provisions for occupational therapy; amending prescribing authority for legend drugs; providing penalties.",
        "presented": "5/3/13",
        "bill": "SF 887",
        "signed": "5/7/13",
        "chamber": "senate",
        "senate_vote": "45-20",
        "vetoed": "0"
    },
    {
        "chapter": "42",
        "house_vote": "103-24",
        "signed_no_signature": "0",
        "description": "Relating to liquor; regulating alcohol sales and distribution; authorizing and modifying various licenses.",
        "presented": "5/3/13",
        "bill": "SF 541",
        "signed": "5/7/13",
        "chamber": "senate",
        "senate_vote": "61-4",
        "vetoed": "0"
    },
    {
        "chapter": "41",
        "house_vote": "81-49",
        "signed_no_signature": "0",
        "description": "Relating to local government; giving Hennepin County the same authority as Minneapolis to negotiate agreements relating to skilled trade and craft workers and apprentices.",
        "presented": "5/3/13",
        "bill": "HF 1195",
        "signed": "5/7/13",
        "chamber": "house",
        "senate_vote": "63-0",
        "vetoed": "0"
    },
    {
        "chapter": "40",
        "house_vote": "106-27",
        "signed_no_signature": "0",
        "description": "Relating to commerce; regulating certain lenders that use motor vehicle titles of the borrower as collateral.",
        "presented": "5/3/13",
        "bill": "HF 648",
        "signed": "5/7/13",
        "chamber": "house",
        "senate_vote": "58-0",
        "vetoed": "0"
    },
    {
        "chapter": "39",
        "house_vote": "128-0",
        "signed_no_signature": "0",
        "description": "Relating to crime victims; authorizing a victim's estate to request or enforce an order for restitution.",
        "presented": "5/2/13",
        "bill": "SF 345",
        "signed": "5/6/13",
        "chamber": "senate",
        "senate_vote": "64-0",
        "vetoed": "0"
    },
    {
        "chapter": "38",
        "house_vote": "130-0",
        "signed_no_signature": "0",
        "description": "Relating to mines; making technical, clarifying, and other policy changes to mine inspector provisions.",
        "presented": "4/30/13",
        "bill": "SF 1291",
        "signed": "5/2/13",
        "chamber": "senate",
        "senate_vote": "63-0",
        "vetoed": "0"
    },
    {
        "chapter": "37",
        "house_vote": "77-49",
        "signed_no_signature": "0",
        "description": "Relating to judiciary; modifying certain provisions relating to the State Guardian Ad Litem Board.",
        "presented": "4/30/13",
        "bill": "SF 834",
        "signed": "5/2/13",
        "chamber": "senate",
        "senate_vote": "61-0",
        "vetoed": "0"
    },
    {
        "chapter": "36",
        "house_vote": "126-0",
        "signed_no_signature": "0",
        "description": "Relating to civil law; allowing agency designations on certain accounts; providing form language; making clarifying changes; clarifying filing requirements for appeals to Tax Court.",
        "presented": "4/29/13",
        "bill": "HF 19",
        "signed": "5/1/13",
        "chamber": "house",
        "senate_vote": "64-0",
        "vetoed": "0"
    },
    {
        "chapter": "35",
        "house_vote": "127-0",
        "signed_no_signature": "0",
        "description": "Relating to the state auditor; requiring employees and officers of local public pension plans to report unlawful actions.",
        "presented": "4/29/13",
        "bill": "SF 324",
        "signed": "5/1/13",
        "chamber": "senate",
        "senate_vote": "61-0",
        "vetoed": "0"
    },
    {
        "chapter": "34",
        "house_vote": "131-0",
        "signed_no_signature": "0",
        "description": "Relating to public safety; clarifying certain statutory provisions relating to crime victim rights and programs; providing for a restitution working group.",
        "presented": "4/29/13",
        "bill": "SF 769",
        "signed": "5/1/13",
        "chamber": "senate",
        "senate_vote": "64-0",
        "vetoed": "0"
    },
    {
        "chapter": "33",
        "house_vote": "123-3",
        "signed_no_signature": "0",
        "description": "Relating to workers' compensation; modifying Workers' Compensation Court of Appeals personnel provisions.",
        "presented": "4/29/13",
        "bill": "HF 1378",
        "signed": "5/1/13",
        "chamber": "house",
        "senate_vote": "65-0",
        "vetoed": "0"
    },
    {
        "chapter": "32",
        "house_vote": "107-18",
        "signed_no_signature": "0",
        "description": "Relating to public safety; expanding and updating the authority of the Statewide Radio Board to include the latest emergency communication technologies; authorizing the Statewide Radio Board to elect to become a statewide emergency communication board; including tribal governments in regional radio board structure; providing comprehensive authority under board to address all emergency communications; providing for rulemaking; requiring a study.",
        "presented": "4/29/13",
        "bill": "HF 669",
        "signed": "5/1/13",
        "chamber": "house",
        "senate_vote": "65-0",
        "vetoed": "0"
    },
    {
        "chapter": "31",
        "house_vote": "131-0",
        "signed_no_signature": "0",
        "description": "Relating to nursing; modifying definitions in the Minnesota Nurse Practicing.",
        "presented": "4/29/13",
        "bill": "SF 1016",
        "signed": "5/1/13",
        "chamber": "senate",
        "senate_vote": "47-18",
        "vetoed": "0"
    },
    {
        "chapter": "30",
        "house_vote": "131-0",
        "signed_no_signature": "0",
        "description": "Relating to children; creating the Family Reunification Act of 2013.",
        "presented": "4/29/13",
        "bill": "SF 422",
        "signed": "5/1/13",
        "chamber": "senate",
        "senate_vote": "63-0",
        "vetoed": "0"
    },
    {
        "chapter": "29",
        "house_vote": "131-0",
        "signed_no_signature": "0",
        "description": "Relating to human services; modifying membership requirements for the Council on Disability.",
        "presented": "4/29/13",
        "bill": "SF 442",
        "signed": "5/1/13",
        "chamber": "senate",
        "senate_vote": "64-0",
        "vetoed": "0"
    },
    {
        "chapter": "28",
        "house_vote": "117-14",
        "signed_no_signature": "0",
        "description": "Relating to evidence; limiting availability of certain evidence arising from a collaborative law process. This bill passed with broad bipartisan support.",
        "presented": "4/25/13",
        "bill": "HF 283",
        "signed": "4/29/13",
        "chamber": "house",
        "senate_vote": "64-0",
        "vetoed": "0"
    },
    {
        "chapter": "27",
        "house_vote": "131-0",
        "signed_no_signature": "0",
        "description": "Relating to employment; modifying prompt payment of wages requirements; modifying penalties. This bill passed with broad bipartisan support.",
        "presented": "4/25/13",
        "bill": "HF 748",
        "signed": "4/29/13",
        "chamber": "house",
        "senate_vote": "60-2",
        "vetoed": "0"
    },
    {
        "chapter": "26",
        "house_vote": "133-0",
        "signed_no_signature": "0",
        "description": "Relating to state government; designating the month of April as Genocide Awareness and Prevention Month. This bill passed with broad bipartisan support.",
        "presented": "4/25/13",
        "bill": "SF 359",
        "signed": "4/29/13",
        "chamber": "senate",
        "senate_vote": "66-1",
        "vetoed": "0"
    },
    {
        "chapter": "25",
        "house_vote": "134-0",
        "signed_no_signature": "0",
        "description": "Relating to health; modifying a social work licensure provision.  This bill passed the State House and Senate unanimously.",
        "presented": "4/24/13",
        "bill": "SF 953",
        "signed": "4/25/13",
        "chamber": "senate",
        "senate_vote": "61-0",
        "vetoed": "0"
    },
    {
        "chapter": "24",
        "house_vote": "132-0",
        "signed_no_signature": "0",
        "description": "Relating to community property; adopting the Uniform Community Property Rights at Death Act.  This bill passed with broad bipartisan support.",
        "presented": "4/24/13",
        "bill": "HF 369",
        "signed": "4/25/13",
        "chamber": "house",
        "senate_vote": "65-1",
        "vetoed": "0"
    },
    {
        "chapter": "23",
        "house_vote": "129-0",
        "signed_no_signature": "0",
        "description": "Relating to civil law; modifying the statutory short form power of attorney; authorizing certain judicial relief. This bill passed both the State House and Senate with unanimous support.",
        "presented": "4/22/13",
        "bill": "HF 232",
        "signed": "4/24/13",
        "chamber": "house",
        "senate_vote": "66-0",
        "vetoed": "0"
    },
    {
        "chapter": "22",
        "house_vote": "127-0",
        "signed_no_signature": "0",
        "description": "Relating to veterans; authorizing placement of a plaque in the court of honor on the Capitol grounds to honor American Indian veterans from this state. This bill passed both the State House and Senate with unanimous support.",
        "presented": "4/22/13",
        "bill": "HF 143",
        "signed": "4/24/13",
        "chamber": "house",
        "senate_vote": "64-0",
        "vetoed": "0"
    },
    {
        "chapter": "21",
        "house_vote": "131-0",
        "signed_no_signature": "0",
        "description": "Relating to civil actions; modifying the limitations of actions for damages based on services or construction to improve real property. This bill passed both the State House and Senate with unanimous support.",
        "presented": "4/22/13",
        "bill": "HF 450",
        "signed": "4/24/13",
        "chamber": "house",
        "senate_vote": "64-0",
        "vetoed": "0"
    },
    {
        "chapter": "20",
        "house_vote": "130-0",
        "signed_no_signature": "0",
        "description": "Relating to public safety; creating new crimes relating to 911 emergency calls; providing criminal penalties. This bill passed both the State House and Senate with unanimous support.",
        "presented": "4/22/13",
        "bill": "SF 1168",
        "signed": "4/24/13",
        "chamber": "senate",
        "senate_vote": "62-0",
        "vetoed": "0"
    },
    {
        "chapter": "19",
        "house_vote": "78-53",
        "signed_no_signature": "0",
        "description": "Relating to metropolitan planning activities; extending the sunset date of the Metropolitan Area Water Supply Advisory committee.",
        "presented": "4/19/13",
        "bill": "HF 834",
        "signed": "4/22/13",
        "chamber": "house",
        "senate_vote": "45-20",
        "vetoed": "0"
    },
    {
        "chapter": "18",
        "house_vote": "129-1",
        "signed_no_signature": "0",
        "description": "Relating to health; requiring continuing education hours for certification as a community paramedic.",
        "presented": "4/19/13",
        "bill": "HF 75",
        "signed": "4/22/13",
        "chamber": "house",
        "senate_vote": "66-0",
        "vetoed": "0"
    },
    {
        "chapter": "17",
        "house_vote": "132-0",
        "signed_no_signature": "0",
        "description": "Relating to commerce; regulating mortgage foreclosures; clarifying the definition of a foreclosure consultant.  This bill passed the House and Senate with unanimous support.",
        "presented": "4/19/13",
        "bill": "HF 129",
        "signed": "4/22/13",
        "chamber": "house",
        "senate_vote": "62-0",
        "vetoed": "0"
    },
    {
        "chapter": "16",
        "house_vote": "133-0",
        "signed_no_signature": "0",
        "description": "Relating to state government; modifying false claims provisions.",
        "presented": "4/19/13",
        "bill": "HF 290",
        "signed": "4/22/13",
        "chamber": "house",
        "senate_vote": "60-3",
        "vetoed": "0"
    },
    {
        "chapter": "15",
        "house_vote": "124-7",
        "signed_no_signature": "0",
        "description": "Relating to workers’ compensation reinsurance; eliminating the reinsurance association prefunded limit.",
        "presented": "4/18/13",
        "bill": "HF 504",
        "signed": "4/22/13",
        "chamber": "house",
        "senate_vote": "64-1",
        "vetoed": "0"
    },
    {
        "chapter": "14",
        "house_vote": "131-0",
        "signed_no_signature": "0",
        "description": "Relating to human rights; ensuring public accommodations for blind and disabled persons.  This bill passed the House and Senate with unanimous support.",
        "presented": "4/18/13",
        "bill": "SF 1086",
        "signed": "4/22/13",
        "chamber": "senate",
        "senate_vote": "65-0",
        "vetoed": "0"
    },
    {
        "chapter": "13",
        "house_vote": "130-0",
        "signed_no_signature": "0",
        "description": "Relating to emergency medical services; modifying certain provisions to include advanced emergency medical technicians; updating inspection provisions; providing requirements for emergency medical responder registration.  This bill passed both bodies of the State Legislature with broad bipartisan support.",
        "presented": "4/12/13",
        "bill": "SF 166",
        "signed": "4/15/13",
        "chamber": "senate",
        "senate_vote": "63-0",
        "vetoed": "0"
    },
    {
        "chapter": "12",
        "house_vote": "130-0",
        "signed_no_signature": "0",
        "description": "Designating a segment of marked Trunk Highway 23 as Officer Tom Decker Memorial Highway. This bill passed both bodies of the State Legislature with unanimous support.",
        "presented": "4/12/13",
        "bill": "SF 76",
        "signed": "4/16/13",
        "chamber": "senate",
        "senate_vote": "61-0",
        "vetoed": "0"
    },
    {
        "chapter": "11",
        "house_vote": "102-28",
        "signed_no_signature": "0",
        "description": "Relating to health; changing provisions for radiation therapy facility construction.",
        "presented": "4/12/13",
        "bill": "HF 164",
        "signed": "4/15/13",
        "chamber": "house",
        "senate_vote": "52-13",
        "vetoed": "0"
    },
    {
        "chapter": "10",
        "house_vote": "125-2",
        "signed_no_signature": "0",
        "description": "Affidavit of survivorship and release or partial release of mortgage lien provided; interested in registered land after resignation claimed; technical and conforming changes made. This bill passed both bodies of the State Legislature with broad bipartisan support.",
        "presented": "3/19/13",
        "bill": "HF 87",
        "signed": "3/21/13",
        "chamber": "house",
        "senate_vote": "65-0",
        "vetoed": "0"
    },
    {
        "chapter": "9",
        "house_vote": "72-61",
        "signed_no_signature": "0",
        "description": "Minnesota Insurance Marketplace established, powers and duties prescribed, abortion coverage prohibited with certain exemptions, person's physician of choice right recognized, right to not participate established, open meeting requirements and data practice procedures specified, and money appropriated.",
        "presented": "3/19/13",
        "bill": "HF 5",
        "signed": "3/20/13",
        "chamber": "house",
        "senate_vote": "39-28",
        "vetoed": "0"
    },
    {
        "chapter": "8",
        "house_vote": "126-0",
        "signed_no_signature": "0",
        "description": "Advanced diagnostic imaging service accreditation required for operation in Minnesota.  This bill passed the Legislature with unanimous support.",
        "presented": "3/14/13",
        "bill": "HF 582",
        "signed": "3/15/13",
        "chamber": "house",
        "senate_vote": "64-0",
        "vetoed": "0"
    },
    {
        "chapter": "7",
        "house_vote": "124-0",
        "signed_no_signature": "0",
        "description": "Uniform Electronic Legal Material Act enacted as approved by the National Conference of Commissioners on Uniform State Laws. This bill passed the legislature with broad bi-partisan support.",
        "presented": "3/12/13",
        "bill": "HF 278",
        "signed": "3/14/13",
        "chamber": "house",
        "senate_vote": "64-1",
        "vetoed": "0"
    },
    {
        "chapter": "6",
        "house_vote": "127-0",
        "signed_no_signature": "0",
        "description": "Electronic fund transfers regulated, and providing that Uniform Commercial Code article 4A does not apply to a remittance transfer that is not an electronic funds transfer under the federal Electronic Fund Transfer Act. This bill passed the legislature with unanimous support.",
        "presented": "3/12/13",
        "bill": "HF 365",
        "signed": "3/15/13",
        "chamber": "house",
        "senate_vote": "64-0",
        "vetoed": "0"
    },
    {
        "chapter": "5",
        "house_vote": "122-0",
        "signed_no_signature": "0",
        "description": "Financial exploitation of a vulnerable adult offenses allowed to be aggregated over a six month period, and venue options expanded. This bill passed the legislature with unanimous support.",
        "presented": "3/12/13",
        "bill": "HF 90",
        "signed": "3/14/13",
        "chamber": "house",
        "senate_vote": "63-0",
        "vetoed": "0"
    },
    {
        "chapter": "4",
        "house_vote": "128-0",
        "signed_no_signature": "0",
        "description": "Modifying drainage system provisions. This bill passed the legislature with unanimous support.",
        "presented": "3/12/13",
        "bill": "HF 66",
        "signed": "3/14/13",
        "chamber": "house",
        "senate_vote": "62-0",
        "vetoed": "0"
    },
    {
        "chapter": "3",
        "house_vote": "109-19",
        "signed_no_signature": "0",
        "description": "Income, franchise, and property tax refund provisions for tax year 2012 conformed to the provisions of the Federal Aviation Administration Modernization and Reform Act of 2012 and the American Taxpayer Relief Act of 2012.",
        "presented": "2/19/13",
        "bill": "HF 6",
        "signed": "2/20/13",
        "chamber": "house",
        "senate_vote": "66-0",
        "vetoed": "0"
    },
    {
        "chapter": "2",
        "house_vote": "83-44",
        "signed_no_signature": "0",
        "description": "A bill ratifying state labor agreements and compensation plans.",
        "presented": "2/18/13",
        "bill": "SF 58",
        "signed": "2/19/13",
        "chamber": "senate",
        "senate_vote": "40-25",
        "vetoed": "0"
    },
    {
        "chapter": "1",
        "house_vote": "71-56",
        "signed_no_signature": "0",
        "description": "Medical assistance eligibility expanded, and modified adjusted gross income and standard income disregard use required.",
        "presented": "2/15/13",
        "bill": "HF 9",
        "signed": "2/19/13",
        "chamber": "house",
        "senate_vote": "45-22",
        "vetoed": "0"
    }
]